In [2]:
import pandas as pd

In [29]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2],
  'prosent':[85,88,89]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings  prosent
0    BMW         3       85
1  Volvo         7       88
2   Ford         2       89

In [9]:
# pd.Series?

In [21]:
pyList= [10,20,30,40]
pdSerie = pd.Series(pyList)
pdSerie

0    10
1    20
2    30
3    40
dtype: int64

0    10
1    20
2    30
3    40
dtype: int64

In [25]:
pyDict = {"sverige":"stockholm","finland":"helsingfors","norge":"oslo"}
pdSeris2 = pd.Series(pyDict)
pdSeris2

sverige      stockholm
finland    helsingfors
norge             oslo
dtype: object

### Data Frame

In [24]:
# pdDF = pd.DataFrame?

In [ ]:
pdDF = pd.DataFrame

In [31]:
pdDF = pd.DataFrame(pyDict,index=[0,1,2])
pdDF

     sverige      finland norge
0  stockholm  helsingfors  oslo
1  stockholm  helsingfors  oslo
2  stockholm  helsingfors  oslo

In [40]:
## vi skaper vår tvådimensionella data -x och y axeln måste ha npgont gemensamt!
#1D programmeringsårk och deras popularitet
#2D Geografisk
progArc = pd.Series([1,2,3,4],index=["Javascript", "Python","Java","C"])
progArc

# progMetro = pd.Series([1,2,3,4],index=["C", "Java","Python","Javascript"])
# progMetro

progMetro = pd.Series({"C":1, "Java":2,"Python":3,"Javascript":4})
progMetro

C             1
Java          2
Python        3
Javascript    4
dtype: int64

In [41]:
progArc = pd.Series([1,2,3,4],index=["Javascript", "Python","Java","C"])
progArc

Javascript    1
Python        2
Java          3
C             4
dtype: int64

In [50]:
progDF= pd.DataFrame({"Arcada":progArc,"Metropolia":progMetro})
progDF

            Arcada  Metropolia
C                4           1
Java             3           2
Javascript       1           4
Python           2           3

In [133]:
#  se på övnigen för att lösa projekt 1
Farnado = pd.Series([2,3,4,5,6,7],index=["Kapitel nr:"]*6 )
Farnado

Kelly = pd.Series([2,4,6,"","",""] ,index=["Kapitel nr:"]*6 )
Kelly

Vallisneri = pd.Series([6,7,"","","",""],index=["Kapitel nr:"]*6 )
Vallisneri

Kapitel nr:    6
Kapitel nr:    7
Kapitel nr:
Kapitel nr:
Kapitel nr:
Kapitel nr:
dtype: object

In [110]:
tasksForP1 = pd.DataFrame(  {"Farnado":Farnado, "Kelly":Kelly , "Vallisneri":Vallisneri})
tasksForP1

             Farnado Kelly Vallisneri
Kapitel nr:        2     2          6
Kapitel nr:        3     4          7
Kapitel nr:        4     6
Kapitel nr:        5
Kapitel nr:        6
Kapitel nr:        7

### In learning Farnaso contents 2 - 7

In [3]:
# Farnado kapitel nr 2
oo = pd.read_csv("../../../Ex_Files_Pandas_EssT/ExerciseFiles/data/olympics.csv",skiprows=4)

2. kapitel Series and DataFrames

In [145]:
# oo.head()

In [118]:
#//list our olympics DataFrame
# oo

In [169]:
# list only the NOC using both [".."].
oo["NOC"]
oo.NOC

oo[["City","Sport","Athlete"]].head(2)

     City     Sport           Athlete
0  Athens  Aquatics     HAJOS, Alfred
1  Athens  Aquatics  HERSCHMANN, Otto

In [138]:
# type(tasksForP1) // pandas.core.frame.DataFrame
# type(Farnado) // pandas.core.series.Series
# type(oo.NOC) // pandas.core.series.Series
# type(oo[["City","Sport","Athlete"]]) // pandas.core.frame.DataFrame

kapitel 3 data input an validation

In [147]:
# data input = read_excel, read_json, read_sql_table .
# shiftTab // autofil in method 
# shape DataFrame.shape

In [1]:
oo3 =  pd.read_csv("../../../Ex_Files_Pandas_EssT/ExerciseFiles/data/olympics.csv" ,skiprows=4) 
# oo3
# oo3.shape // (29216, 10) // rows,  columns
# oo3.shape[0] // (29216 ) // rows,  
# oo3.shape[1] // (10 ) // columns

NameError: name 'pd' is not defined

In [158]:
# oo3.tail()  print last 5 row and columns 
# oo3.head()  print first 5 row and columns // add(3 ) print 3

In [5]:
# oo3.info() // get all informaiton aboute the scv
oo.head(2)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver

Kapitel 4 Basic analysis

In [249]:
oo.Edition.value_counts().head(2)
# oo.Edition.value_counts().head(5)
oo.Gender.value_counts()
oo.Gender.value_counts(ascending=True, dropna=False)

Women     7495
Men      21721
Name: Gender, dtype: int64

In [61]:
ath = oo.Athlete.sort_values()
ath

651                 AABYE, Edgar
2849       AALTONEN, Arvo Ossian
2852       AALTONEN, Arvo Ossian
7716    AALTONEN, Paavo Johannes
7730    AALTONEN, Paavo Johannes
                  ...
603                   ÖSTMO, Ole
608                   ÖSTMO, Ole
621                   ÖSTMO, Ole
596                   ÖSTMO, Ole
8051           ÖSTRAND, Per-Olof
Name: Athlete, Length: 29216, dtype: object

In [218]:
# oo.sort_values(by=["Edition","Athlete"])

In [245]:
# boolean indexing 
oo.head(2).Medal=="Gold"

0     True
1    False
Name: Medal, dtype: bool

In [56]:
oo_women =oo[(oo.Gender=="Women") &( oo.Medal=="Gold")  &( oo.Sport=="Tennis")].head(2).sort_values("Edition")
oo_women

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
641,Paris,1900,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,mixed doubles,X,Gold
649,Paris,1900,Tennis,Tennis,"COOPER, Charlotte",GBR,Women,singles,W,Gold

In [54]:
# String Handling
oo_Florence = oo.Athlete.str.contains("Florence")
oo_test_usa = oo.NOC.str.contains("USA")
oo_test_event = oo.Event.str.contains("200m")
oo_best_match = oo[(oo_Florence) & (oo_test_usa) &(oo_test_event) ]
oo_best_match
# oo[(oo_Florence) ].head(2)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
16817,Los Angeles,1984,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,200m,W,Silver
18305,Seoul,1988,Athletics,Athletics,"GRIFFITH-JOYNER, Florence",USA,Women,200m,W,Gold

In [39]:
# oo_test_Owens = [oo.Athlete.str.contains("OWENS, Jesse")]  // come true & false
oo_test_Owens = oo[oo.Athlete.str.contains("OWENS, Jesse")] 

oo_test_Owens

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
6427,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,100m,M,Gold
6439,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,200m,M,Gold
6456,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,4x100m relay,M,Gold
6523,Berlin,1936,Athletics,Athletics,"OWENS, Jesse",USA,Men,long jump,M,Gold

In [36]:
#  ath = oo.Athlete.sort_values()
oo_test_Owens.Event.value_counts()

100m            1
200m            1
4x100m relay    1
long jump       1
Name: Event, dtype: int64

In [49]:
# WHICH COUNTRY HAS WON THEM most mens gold medals in singles badmintons over the years
oo_most_gold_badminton = oo[(oo.Medal=="Gold") & (oo.Gender=="Men") & (oo.Sport=="Badminton")]
oo_most_gold_badminton.sort_values(by="Athlete").head(2)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
20045,Barcelona,1992,Badminton,Badminton,"BUDI KUSUMA, Alan",INA,Men,singles,M,Gold
23701,Sydney,2000,Badminton,Badminton,"GUNAWAN, Tony",INA,Men,doubles,M,Gold

In [124]:
#  ath = oo.Athlete.sort_values()
# oo_test_Owens.Event.value_counts()
#  index=pd.date_range(start="2014-02-12", end="2014-02-15", freq="D"),
# oo_most_medals = oo.Edition.sort_values(min)
oo_most_medals_start = oo.Edition >= 1984 
oo_most_medals = oo[oo.Edition >= 1984 ]
oo_most_medals_end = oo.Edition <= 1990
# oo_most_medals = oo[(oo_most_medals_start)&(oo_most_medals_end)]
# oo_most_medals.sort_values(by="NOC")
#  oo_most_medals_start.NOC.value_counts().head(3)

oo_most_medals.NOC.value_counts().head(3)

USA    1837
AUS     762
GER     691
Name: NOC, dtype: int64

In [125]:
#  https://www.linkedin.com/learning/pandas-essential-training/solution-3?autoplay=true&resume=false&u=56747801
# time on 4. Basick analysis video on 6:45

In [15]:
oo_get_gmh =oo[(oo.Gender=="Men")&(oo.Medal=="Gold")&(oo.Event=="100m")]

In [29]:
# display the male gold medal winners for the 100m track list the results starting with the most recent . show the olympic city, edition, althete and country they represent
oo_get_gmh
oo_get_gmh.sort_values("Edition",ascending=False)[["City","Edition","Athlete","NOC"]].head(4)

          City  Edition          Athlete  NOC
27552  Beijing     2008      BOLT, Usain  JAM
25539   Athens     2004   GATLIN, Justin  USA
23521   Sydney     2000  GREENE, Maurice  USA
21598  Atlanta     1996  BAILEY, Donovan  CAN